Repository: vnonnenmacher/bayleaf-flutter
Catalog: lib/l10n/app_*.arb
Languages: pt

# welcome
source: Welcome to CuidaDora
pt: Bem-vindo ao CuidaDora

# systemUnavailable
source: Our system is currently unavailable. Please try again later.
pt: Nosso sistema está indisponível no momento. Por favor, tente novamente mais tarde.

# loginFailed
source: Login failed. Please check your credentials.
pt: Falha no login. Verifique suas credenciais.

source: Enter email
pt: Digite o e-mail

source: Password
pt: Senha

# minPasswordLength
source: Minimum 6 characters
pt: Mínimo de 6 caracteres

source: Login
pt: Entrar

# registerPrompt
source: Don't have an account? Register here
pt: Não tem uma conta? Cadastre-se aqui

# registrationTitle
source: Create your patient account
pt: Crie sua conta

source: First Name
pt: Nome

source: Enter first name
pt: Digite o nome

source: Last Name
pt: Sobrenome

source: Enter last name
pt: Digite o sobrenome

# birthDate
source: Birth Date (DD/MM/YYYY)
pt: Data de nascimento (DD/MM/AAAA)

source: Enter birth date
pt: Digite a data de nascimento

source: Register
pt: Cadastrar

source: Back to login
pt: Voltar para login

source: Invalid birth date format
pt: Formato de data de nascimento inválido

# menuMedications
source: Medications
pt: Medicamentos

# menuAppointments
source: Appointments
pt: Consultas

# menuExams
source: Exams
pt: Exames

# menuDoctors
source: Doctors
pt: Profissionais

# menuTreatment
source: Treatment
pt: Tratamento

# menuOrientations
source: Orientations
pt: Orientacoes

# appointmentsUpcoming
source: Upcoming
pt: Próximas

# appointmentsPast
source: Past
pt: Passadas

# appointmentsLoading
source: Loading...
pt: Carregando...

# appointmentsToday
source: Today
pt: Hoje

# appointmentsTomorrow
source: Tomorrow
pt: Amanhã

# appointmentsInXDays
source: In {days} days
pt: Em {days} dias

# appointmentsNoneUpcoming
source: No upcoming appointments yet
pt: Nenhuma consulta futura

# appointmentsNoneUpcomingDesc
source: Book your next visit and stay on top of your health.
pt: Agende sua próxima consulta e cuide da sua saúde.

# appointmentsNonePast
source: You haven’t had any appointments yet
pt: Você ainda não teve consultas

# appointmentsNonePastDesc
source: Once you complete a visit, it’ll appear here.
pt: Assim que concluir uma consulta, ela aparecerá aqui.

# appointmentsBookAppointment
source: Book Appointment
pt: Agendar Consulta

# appointmentsReschedule
source: Reschedule
pt: Reagendar

# appointmentsCancel
source: Cancel
pt: Cancelar

# appointmentsBookAgain
source: Book Again
pt: Agendar Novamente

# appointmentsUnknownDoctor
source: Unknown Doctor
pt: Médico desconhecido

# appointmentsGeneralPractitioner
source: General Practitioner
pt: Clínico Geral

# appointmentsClinicName
source: Clinic Name
pt: Nome da Clínica

# statusConfirmed
source: Confirmed
pt: Confirmada

# statusRequested
source: Requested
pt: Solicitada

# statusCancelled
source: Cancelled
pt: Cancelada

# vaccinesTabTitle
source: Vaccines
pt: Vacinas

# vaccinesUpcoming
source: Upcoming Vaccines
pt: Próximas vacinas

source: Vaccines Taken
pt: Vacinas tomadas

# tooltipAddMedication
source: Add Medication
pt: Adicionar medicamento

# tooltipAddVaccine
source: Add Vaccine
pt: Adicionar vacina

# medicationsLoadError
source: Couldn’t load medications. Pull to refresh or try again later.
pt: Não foi possível carregar os medicamentos. Puxe para atualizar ou tente novamente depois.

# medicationsNoneTitle
source: No medications yet
pt: Nenhum medicamento ainda

# medicationsNoneDesc
source: When your doctor prescribes a medication, it will appear here.
pt: Quando seu médico prescrever um medicamento, ele aparecerá aqui.

# medicationFallback
source: Medication
pt: Medicamento

# everyXHours
source: Every {hours}h
pt: A cada {hours}h

source: As prescribed
pt: Conforme prescrição

# doraHelloTitle
source: Hi, I’m Dora
pt: Olá, eu sou a Dora

# doraHelloSubtitle
source: I’ll guide you through your first steps.
pt: Vou te acompanhar nos primeiros passos.

# iAmNewHere
source: I’m new here
pt: Eu sou novo aqui

source: I already have an account
pt: Eu já possuo uma conta

# roleDefTitle
source: Choose your role
pt: Escolha seu perfil

# roleDefSubtitle
source: This helps us personalize your experience.
pt: Isso nos ajuda a personalizar a sua experiência.

# roleDefPatientTitle
source: I am following a medical treatment
pt: Eu sigo um tratamento médico

# roleDefPatientSubtitle
source: I need assistance to organize my care.
pt: Preciso de auxílio para organizar meus cuidados.

# roleDefFamilyTitle
source: I am a family member or legal guardian
pt: Sou familiar ou responsável

# roleDefFamilySubtitle
source: I help one or more patients with their care.
pt: Auxilio um ou mais pacientes nos cuidados.

# roleDefCaregiverTitle
source: I am a caregiver
pt: Sou cuidador(a)

# roleDefCaregiverSubtitle
source: I take care of one or more patients.
pt: Cuido de um ou mais pacientes.

source: Back
pt: Voltar

# acceptTermsOfUse
source: Accept Terms of Use of Cuida Dora
pt: Aceitar os termos de uso da Cuida Dora

# viewTerms
source: View Terms of use.
pt: Ver termos de uso.

# selectPatientTitle
source: Select your patient
pt: Selecione seu paciente

# selectRelativeTitle
source: Select your relative
pt: Selecione seu familiar

source: Add patient
pt: Adicionar paciente

# noPatientsTitleProfessional
source: No patients linked
pt: Nenhum paciente vinculado

# noPatientsHintProfessional
source: Tap the + button to add a patient under your care.
pt: Toque no botão + para adicionar um paciente sob seus cuidados.

# noPatientsTitleRelative
source: No relatives linked
pt: Nenhum familiar vinculado

# noPatientsHintRelative
source: Tap the + button to add a relative under your care.
pt: Toque no botão + para adicionar um familiar sob seus cuidados.

# addPatientComingSoonTitle
source: Add patient
pt: Adicionar paciente

# addPatientComingSoonBodyProfessional
source: This feature will be available soon. For now, you can continue using the app and select a patient later.
pt: Este recurso estará disponível em breve. Por enquanto, você pode continuar usando o app e selecionar um paciente depois.

# addPatientComingSoonBodyRelative
source: This feature will be available soon. For now, you can continue and link a family member later.
pt: Este recurso estará disponível em breve. Por enquanto, você pode continuar e vincular um familiar depois.

# doraChatTitle
source: Chat with Dora
pt: Conversa com a Dora

source: Type your message...
pt: Digite sua mensagem...

# profile_title
source: Profile
pt: Perfil

# profile_edit_title
source: Edit Profile
pt: Editar Perfil

# profile_edit_mode
source: You're now editing your profile
pt: Você agora está editando seu perfil

# profile_update_success
source: Profile updated successfully!
pt: Perfil atualizado com sucesso!

# profile_update_fail
source: Failed to update profile.
pt: Falha ao atualizar o perfil.

# profile_tabs_personal
source: Personal Info
pt: Dados pessoais

# profile_tabs_address
source: Address
pt: Endereço

# profile_tabs_financial
source: Financials
pt: Financeiro

# profile_first_name
source: First Name
pt: Nome

# profile_last_name
source: Last Name
pt: Sobrenome

# profile_date_of_birth
source: Date of Birth
pt: Data de Nascimento

# profile_street
source: Street
pt: Rua

# profile_city
source: City
pt: Cidade

# profile_zip
source: ZIP Code
pt: CEP

# profile_state
source: State
pt: Estado

# profile_forgot_password
source: Forgot Password
pt: Esqueci minha senha

# profile_logout
source: Logout
pt: Sair

# profile_logout_confirm
source: Are you sure you want to logout?
pt: Tem certeza que deseja sair?

# profile_financial_placeholder
source: Financial info not implemented yet.
pt: Informações financeiras ainda não implementadas.

# profile_unknown_tab
source: Unknown tab selected.
pt: Aba desconhecida selecionada.
